       IDENTIFICATION DIVISION.
       PROGRAM-ID. WAIT.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.     
       SPECIAL-NAMES.             
       DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

            01  WS-FECHA            PIC 9(14)    VALUE ZEROES.

       PROCEDURE DIVISION.
       MAIN-PROGRAM.

       F-MAIN-PROGRAM. GOBACK.
